#+AUTHOR: marius@cicadalabs.io
#+DESCRIPTION: Testing of HDW implementation and address encoding in bitcoinj

Code snippet from the gist: https://gist.github.com/mutatrum/48af22c0f63cc1cc7d24d82a9d67e5e3

* How to run

  #+BEGIN_SRC sh
  mvn clean test
  #+END_SRC

  #+RESULTS:
  | [[1;34mINFO[m] | Scanning                                                                          | for                                                  | projects...                            |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---------------------<                                                       | [0;36mcom.example:bitcoinj-test[0;1m             | >----------------------[m            |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1mBuilding                                                                     | bitcoinj-test                                        | 1.0-SNAPSHOT[m                       |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m--------------------------------[                                            | jar                                                  | ]---------------------------------[m |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---                                                                          | [0;32mmaven-clean-plugin:2.5:clean[m             | [1m(default-clean)[m               | @                 | [36mbitcoinj-test[0;1m                                    | ---[m                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Deleting                                                                          | /home/marius/repo/bitcoinj-test/target               |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---                                                                          | [0;32mmaven-resources-plugin:2.6:resources[m     | [1m(default-resources)[m           | @                 | [36mbitcoinj-test[0;1m                                    | ---[m                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Using                                                                             | 'UTF-8'                                              | encoding                               | to                | copy                                                          | filtered                                            | resources. |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | skip                                                                              | non                                                  | existing                               | resourceDirectory | /home/marius/repo/bitcoinj-test/src/main/resources            |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---                                                                          | [0;32mmaven-compiler-plugin:3.1:compile[m        | [1m(default-compile)[m             | @                 | [36mbitcoinj-test[0;1m                                    | ---[m                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | No                                                                                | sources                                              | to                                     | compile           |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---                                                                          | [0;32mmaven-resources-plugin:2.6:testResources[m | [1m(default-testResources)[m       | @                 | [36mbitcoinj-test[0;1m                                    | ---[m                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Using                                                                             | 'UTF-8'                                              | encoding                               | to                | copy                                                          | filtered                                            | resources. |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | skip                                                                              | non                                                  | existing                               | resourceDirectory | /home/marius/repo/bitcoinj-test/src/test/resources            |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---                                                                          | [0;32mmaven-compiler-plugin:3.1:testCompile[m    | [1m(default-testCompile)[m         | @                 | [36mbitcoinj-test[0;1m                                    | ---[m                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Changes                                                                           | detected                                             | -                                      | recompiling       | the                                                           | module!                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Compiling                                                                         | 1                                                    | source                                 | file              | to                                                            | /home/marius/repo/bitcoinj-test/target/test-classes |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m---                                                                          | [0;32mmaven-surefire-plugin:3.2.1:test[m         | [1m(default-test)[m                | @                 | [36mbitcoinj-test[0;1m                                    | ---[m                                             |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Using                                                                             | auto                                                 | detected                               | provider          | org.apache.maven.surefire.junitplatform.JUnitPlatformProvider |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | -------------------------------------------------------                           |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | T                                                                                 | E                                                    | S                                      | T                 | S                                                             |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | -------------------------------------------------------                           |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Running                                                                           | com.example.[1mBitcoinJTest[m                    |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/0:             | bc1qp5wfcq48h6d63wyy9qz0awtpfqwwv4sma86mhz                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/1:             | bc1qrfxr69jqnhwufxgkqgcdep9prq4j4vuw2wyg0v                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/2:             | bc1qhvd6suvqzjcu9pxjhrwhtrlj85ny3n2mqql5w4                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/3:             | bc1qjzgwzugce3mqfvn2cdq8wt8drz50mf6je9utcl                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/4:             | bc1q4lrflkd0sddm4ktujw8e5syxmlwcdprdtzvamp                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/5:             | bc1qc6xkeyekth5xe7lsey3qgxm55nypxe7dfpfawu                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/6:             | bc1qmenjwqyj4kvfftjum5wlakxv4aqglf30tnd8fg                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/7:             | bc1qkq5g90a6f7etapm5el6umchkdpdm77vupjvhmq                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/8:             | bc1qhc6qe9fgw0f7dt4wnmu6zrfhupgmaqs3z28jdd                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/0/9:             | bc1q9lzhdyu9339eky3wcd99u9rtj3erzd94tggshc                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/0:             | bc1q7zwtzcqsm3k43ha0ac7nl8cz0hqrhckywf6sew                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/1:             | bc1qf7x2v0de6hvgv6tke54pyzmkc9022wh5j3f6y5                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/2:             | bc1qa3ht4xx9evh8dp8p66tzftu45zccugw4lnc6nn                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/3:             | bc1q4cunrvqcccqtn39tm8lr7ezvuurvq92nlem720                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/4:             | bc1qaer3qp5y40x8xztq6qegnewxkmn3v6a9kaenzm                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/5:             | bc1q6cqdvcx40upr5nzkm9kvn60dlu7l2jml6fa5k0                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/6:             | bc1q0dq4szzsdu4fjylj7ljf3nnrddzxu9gr7vx2jv                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/7:             | bc1qnp89rs4esd8clrrwx79rw46gw9u3eml7rhfus0                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/8:             | bc1q9u96jy2gdhg5pewls66sj2k9hc78a25g4g2n2m                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | M/1/9:             | bc1qqut75fra5w4k28gpr0n02fcn8xrscnwykmreae                                        |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1;32mTests                                                                     | run:                                                 | [0;1;32m1[m,                       | Failures:         | 0,                                                            | Errors:                                             | 0,         | Skipped: | 0,    | Time | elapsed: | 0.238 | s | -- | in | com.example.[1mBitcoinJTest[m |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Results:                                                                          |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1;32mTests                                                                     | run:                                                 | 1,                                     | Failures:         | 0,                                                            | Errors:                                             | 0,         | Skipped: | 0[m |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] |                                                                                   |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m------------------------------------------------------------------------[m |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1;32mBUILD                                                                     | SUCCESS[m                                          |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m------------------------------------------------------------------------[m |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Total                                                                             | time:                                                | 1.551                                  | s                 |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | Finished                                                                          | at:                                                  | 2023-11-08T12:30:55+04:00              |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  | [[1;34mINFO[m] | [1m------------------------------------------------------------------------[m |                                                      |                                        |                   |                                                               |                                                     |            |          |       |      |          |       |   |    |    |                                   |
  
